[![Open In Colab](https://colab.research.google.com/assets/colab-badge.svg)](https://colab.research.google.com/github/ghodsizadeh/jalali-pandas/examples/basic_usage.ipynb)
![GitHub Repo stars](https://img.shields.io/github/stars/ghodsizadeh/jalali-pandas?logoColor=blue&style=social)

In [1]:
%pip install jalali-pandas

Requirement already satisfied: jalali-pandas in /usr/local/lib/python3.7/dist-packages (0.1.1)
Requirement already satisfied: jdatetime<4.0.0,>=3.6.4 in /usr/local/lib/python3.7/dist-packages (from jalali-pandas) (3.6.4)

In [9]:
import pandas as pd
import jalali_pandas

In [10]:
df = pd.DataFrame({"date": pd.date_range("2019-01-01", periods=10, freq="D")})

# Working with Series

In [11]:
# convert to jalali
df['jdate'] = df.date.jalali.to_jalali()
df.head(2)

        date                jdate
0 2019-01-01  1397-10-11 00:00:00
1 2019-01-02  1397-10-12 00:00:00

In [12]:
# convert jalali to georgian
df['gdate'] = df['jdate'].jalali.to_georgian()

In [13]:
df1 = pd.DataFrame({"date": ["1399/08/02", "1399/08/03", "1399/08/04"]})
df1["jdate"] = df1["date"].jalali.parse_jalali("%Y/%m/%d")

In [14]:
# get access to jalali year,quarter ,month, day and weekday
df['year'] = df["jdate"].jalali.year
df['month'] = df["jdate"].jalali.month
df['quarter'] = df["jdate"].jalali.quarter
df['day'] = df["jdate"].jalali.day
df['weekday'] = df["jdate"].jalali.weekday

# Working With DataFrames

In [15]:
df = pd.DataFrame(
    {
    "date": pd.date_range("2019-01-01", periods=10, freq="M"),
    "value": range(10),
    }
)
# make sure to create a column with jalali datetime format. (you can use any name)
df["jdate"] = df["date"].jalali.to_jalali()

In [16]:
# group by jalali year
gp = df.jalali.groupby("year")
gp.sum()

Column "jdate" will be the refrence.

        value
__year
1397        1
1398       44

In [20]:
mean = df.jalali.groupby('month').mean()

In [22]:
mean = df.jalali.groupby('ymd')
mean.mean()

                      value
__year __month __day
1397   11      11         0
       12      9          1
1398   1       11         2
       2       10         3
       3       10         4
       4       9          5
       5       9          6
       6       9          7
       7       8          8
       8       9          9

In [24]:
mean = df.jalali.groupby('yq')
mean.mean()

                  value
__year __quarter
1397   4            0.5
1398   1            3.0
       2            6.0
       3            8.5